Tekla Open API Reference for Tekla Structures 2025
DoubleConverter Methods
The DoubleConverter type exposes the following members.
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the double datatype.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the double datatype to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the Tekla.Structures.Datatype.Double type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the double datatype to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
DoubleConverter Class
Tekla.Structures.Datatype Namespace